In [4]:
import pandas as pd
import numpy as np

In [5]:
dict={
    "name":["sahil","aniket","swappy","om","vaibhav"],
    "age":[21,22,24,19,19],
    "salary":[10000,25000,35000,45000,780000],
    "city":["raver","muktainager","varangav","shegaon","kolwad"],
}

In [6]:
df=pd.DataFrame(dict)

In [7]:
df

      name  age  salary         city
0    sahil   21   10000        raver
1   aniket   22   25000  muktainager
2   swappy   24   35000     varangav
3       om   19   45000      shegaon
4  vaibhav   19  780000       kolwad

In [17]:
df.head(3)

     name  age  salary         city
0   sahil   21   10000        raver
1  aniket   22   25000  muktainager
2  swappy   24   35000     varangav

In [18]:
df.tail(2)

      name  age  salary     city
3       om   19   45000  shegaon
4  vaibhav   19  780000   kolwad

In [19]:
df.describe()

            age         salary
count   5.00000       5.000000
mean   21.00000  179000.000000
std     2.12132  336217.935274
min    19.00000   10000.000000
25%    19.00000   25000.000000
50%    21.00000   35000.000000
75%    22.00000   45000.000000
max    24.00000  780000.000000

dict=df.to_csv("prathu.csv")

In [31]:
dict=df.to_csv("prathu_index=False.csv",index=False)

In [35]:
dict=pd.read_csv("friend.csv")

prathu["speed"][0]=50